output/posts/object-oriented-programming-some-notes/index.html
<!DOCTYPE html>
<html prefix="        og: http://ogp.me/ns# article: http://ogp.me/ns/article#     " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Object Oriented Programming - Some Notes | Bits of Experience</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://marcohassan.github.io/bits-of-experience/posts/object-oriented-programming-some-notes/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Marco Hassan">
<meta property="og:site_name" content="Bits of Experience">
<meta property="og:title" content="Object Oriented Programming - Some Notes">
<meta property="og:url" content="https://marcohassan.github.io/bits-of-experience/posts/object-oriented-programming-some-notes/">
<meta property="og:description" content="So here are some notes on concepts you have to use when working in a
proper OOP way.



Once upon a time, I had written some notes about major OOP
concepts. Unfortunately it got lost. Learn your lesso">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-11-17T16:37:49+01:00">
</head>
<body>
    <a href="#page-content" class="sr-only sr-only-focusable">Skip to main content</a>
    
    <section class="social"><ul>
<li><a href="../../pages/aboutme/" title="About me"><i class="fa fa-user-circle"></i></a></li>
            <li><a href="../../pages/bits-of-experience-a-readable-view-on-my-study-adventures/" title="Home"><i class="fa fa-home"></i></a></li>
            <li><a href="../../index.html" title="Blog"><i class="fa fa-edit"></i></a></li>
            <li><a href="../../pages/emacs/" title="A life Configuring Emacs"><i class="fa fa-code"></i></a></li>
            <li><a href="../../pages/papers/" title="Term and Research Papers"><i class="fa fa-university"></i></a></li>
            <li><a href="../../pages/foto-blog/" title="Foto Blog"><i class="fa fa-camera-retro"></i></a></li>
            <li><a href="https://github.com/MarcoHassan" title="My Github"><i class="fab fa-github"></i></a></li>
            <li><a href="https://stackoverflow.com/users/9731177/mhass" title="My Stack"><i class="fab fa-stack-overflow"></i></a></li>
            <li><a href="../../rss.xml" title="RSS"><i class="fa fa-rss"></i></a></li>
            <li><a href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i></a></li>
    
    

        </ul></section><section class="page-content"><div class="content" rel="main">
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Object Oriented Programming - Some Notes</a></h1>

        <div class="metadata">
            <p class="dateline"><a href="." rel="bookmark"><i class="fa fa-clock"></i> <time class="published dt-published" datetime="2021-11-17T16:37:49+01:00" itemprop="datePublished" title="2021-11-17 16:37">2021-11-17 16:37</time></a></p>
            <p class="byline author vcard"> <i class="fa fa-user"></i> <span class="byline-name fn" itemprop="author">
                    Marco Hassan
            </span></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink"><i class="fa fa-file-code"></i> Source</a></p>

            

            

        </div>
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
So here are some notes on concepts you have to use when working in a
proper OOP way.
</p>

<p>
Once upon a time, I had written some notes about major OOP
concepts. Unfortunately it got lost. Learn your lesson from it as this
is a real pity.
</p>

<!-- TEASER_END -->

<div id="outline-container-org2330ca7" class="outline-2">
<h2 id="org2330ca7">Callback Methods</h2>
<div class="outline-text-2" id="text-org2330ca7">
<p>
So the basic idea is to create an interface with the methods that
the callback will leverage.
</p>

<p>
Then basically depedning on the object that will implement that
intereface you will fallback to different implementations of it.
</p>

<p>
Check as well at this event. <a href="https://www.tutorialspoint.com/Callback-using-Interfaces-in-Java">Equally good - if not better</a>. 
</p>

<p>
Say for instance the following
</p>

<div class="highlight"><pre><span></span>  <span class="c1">// Java program to demonstrate callback mechanism</span>
  <span class="c1">// using interface is Java</span>

  <span class="c1">// Create interface</span>
  <span class="kn">import</span> <span class="nn">java.util.Scanner</span><span class="p">;</span>
  <span class="kd">interface</span> <span class="nc">STax</span> <span class="p">{</span>
      <span class="kt">double</span> <span class="nf">stateTax</span><span class="p">();</span>
  <span class="p">}</span>

  <span class="c1">// Implementation class of Punjab state tax</span>
  <span class="kd">class</span> <span class="nc">Punjab</span> <span class="kd">implements</span> <span class="n">STax</span> <span class="p">{</span>
      <span class="kd">public</span> <span class="kt">double</span> <span class="nf">stateTax</span><span class="p">()</span>
      <span class="p">{</span>
	  <span class="k">return</span> <span class="mf">3000.0</span><span class="p">;</span>
      <span class="p">}</span>
  <span class="p">}</span>

  <span class="c1">// Implementation class of Himachal Pardesh state tax</span>
  <span class="kd">class</span> <span class="nc">HP</span> <span class="kd">implements</span> <span class="n">STax</span> <span class="p">{</span>
      <span class="kd">public</span> <span class="kt">double</span> <span class="nf">stateTax</span><span class="p">()</span>
      <span class="p">{</span>
	  <span class="k">return</span> <span class="mf">1000.0</span><span class="p">;</span>
      <span class="p">}</span>
  <span class="p">}</span>

  <span class="kd">class</span> <span class="nc">TAX</span> <span class="p">{</span>
      <span class="kd">public</span> <span class="kd">static</span> <span class="kt">void</span> <span class="nf">main</span><span class="p">(</span><span class="n">String</span><span class="o">[]</span> <span class="n">args</span><span class="p">)</span>
  <span class="kd">throws</span> <span class="n">ClassNotFoundException</span><span class="p">,</span> <span class="n">IllegalAccessException</span><span class="p">,</span> <span class="n">InstantiationException</span>
      <span class="p">{</span>
	  <span class="n">Scanner</span> <span class="n">sc</span> <span class="o">=</span> <span class="k">new</span> <span class="n">Scanner</span><span class="p">(</span><span class="n">System</span><span class="p">.</span><span class="na">in</span><span class="p">);</span>
	  <span class="n">System</span><span class="p">.</span><span class="na">out</span><span class="p">.</span><span class="na">println</span><span class="p">(</span><span class="s">"Enter the state name"</span><span class="p">);</span>
	  <span class="n">String</span> <span class="n">state</span> <span class="o">=</span> <span class="n">sc</span><span class="p">.</span><span class="na">next</span><span class="p">();</span> <span class="c1">// name of the state</span>

	  <span class="c1">// The state name is then stored in an object c</span>
	  <span class="n">Class</span> <span class="n">c</span> <span class="o">=</span> <span class="n">Class</span><span class="p">.</span><span class="na">forName</span><span class="p">(</span><span class="n">state</span><span class="p">);</span>

	  <span class="c1">// Create the new object of the class whose name is in  c</span>
	  <span class="c1">// Stax interface reference is now referencing that new object</span>
	  <span class="n">STax</span> <span class="n">ref</span> <span class="o">=</span> <span class="p">(</span><span class="n">STax</span><span class="p">)</span><span class="n">c</span><span class="p">.</span><span class="na">newInstance</span><span class="p">();</span>

	  <span class="cm">/*Call the method to calculate total tax</span>
<span class="cm">	  and pass interface reference - this is callback .</span>
<span class="cm">	  Here, ref may refer to stateTax() of Punjab or HP classes</span>
<span class="cm">	  depending on the class for which the object is created</span>
<span class="cm">	  in the previous step</span>
<span class="cm">	   */</span>

	  <span class="n">calculateTax</span><span class="p">(</span><span class="n">ref</span><span class="p">);</span>
      <span class="p">}</span>
      <span class="kd">static</span> <span class="kt">void</span> <span class="nf">calculateTax</span><span class="p">(</span><span class="n">STax</span> <span class="n">t</span><span class="p">)</span>
      <span class="p">{</span>
	  <span class="c1">// calculate central tax</span>
	  <span class="kt">double</span> <span class="n">ct</span> <span class="o">=</span> <span class="mf">2000.0</span><span class="p">;</span>

	  <span class="c1">// calculate state tax</span>
	  <span class="kt">double</span> <span class="n">st</span> <span class="o">=</span> <span class="n">t</span><span class="p">.</span><span class="na">stateTax</span><span class="p">();</span>
	  <span class="kt">double</span> <span class="n">totaltax</span> <span class="o">=</span> <span class="n">st</span> <span class="o">+</span> <span class="n">ct</span><span class="p">;</span>

	  <span class="c1">// display total tax</span>
	  <span class="n">System</span><span class="p">.</span><span class="na">out</span><span class="p">.</span><span class="na">println</span><span class="p">(</span><span class="s">"Total tax ="</span> <span class="o">+</span> <span class="n">totaltax</span><span class="p">);</span>
      <span class="p">}</span>
  <span class="p">}</span>
</pre></div>
</div>
</div>




<div id="outline-container-org3814b32" class="outline-2">
<h2 id="org3814b32"></h2>
</div>
    </div>
    <aside class="postpromonav"><nav></nav></aside></article><footer id="footer"><p>Contents © 2021         <a href="mailto:marco.hassan30@gmail.com">Marco Hassan</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </section><script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(2, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
